<?php

declare(strict_types=1);

return [

    'RA' => 'خواندن با صدای بلند',
    'RS' => 'تکرار جمله',
    'DI' => 'توصیف تصویر',
    'RL' => 'بازگویی سخنرانی',
    'ASQ' => 'پاسخ کوتاه',

    'SST' => 'خلاصه متن شنیداری',
    'WFD' => 'نوشتن از روی دیکته',
    'MCQ_L' => 'چندگزینه‌ای (شنیداری)',
    'HIW' => 'مشخص‌کردن کلمات نادرست',
    'FIB_L' => 'پرکردن جای خالی (شنیداری)',
    'SMW' => 'انتخاب کلمه جاافتاده',

    'RO' => 'مرتب‌سازی پاراگراف‌ها',
    'FIB_R' => 'پرکردن جای خالی (خواندن)',
    'FIB_RW' => 'پرکردن جای خالی (خواندن و نوشتن)',
    'MCQ_R' => 'چندگزینه‌ای (خواندن)',

    'SWT' => 'خلاصه متن نوشتاری',
    'ESSAY' => 'مقاله‌نویسی',

    'short' => [
        'RA' => 'RA',
        'RS' => 'RS',
        'DI' => 'DI',
        'RL' => 'RL',
        'ASQ' => 'ASQ',
        'SST' => 'SST',
        'WFD' => 'WFD',
        'MCQ_L' => 'MCQ-L',
        'HIW' => 'HIW',
        'FIB_L' => 'FIB-L',
        'SMW' => 'SMW',
        'RO' => 'RO',
        'FIB_R' => 'FIB-R',
        'FIB_RW' => 'FIB-RW',
        'MCQ_R' => 'MCQ-R',
        'SWT' => 'SWT',
        'ESSAY' => 'Essay',
    ],

    'instruction' => [
        'RA' => 'متن زیر را ببینید. :prep ثانیه فرصت آماده‌سازی دارید، سپس آن را با صدای بلند بخوانید.',
        'RS' => 'یک جمله می‌شنوید. دقیقاً همان را تکرار کنید.',
        'DI' => 'به تصویر نگاه کنید. :prep ثانیه فرصت آماده‌سازی دارید، سپس آن را با جزئیات توصیف کنید.',
        'RL' => 'یک سخنرانی می‌شنوید. آن را با زبان خودتان بازگو کنید.',
        'ASQ' => 'یک پرسش می‌شنوید. با یک یا چند کلمه پاسخ دهید.',
        'SST' => 'یک سخنرانی می‌شنوید. خلاصه‌ای بین :min تا :max کلمه بنویسید.',
        'WFD' => 'یک جمله می‌شنوید. دقیقاً همان را تایپ کنید.',
        'MCQ_L' => 'گوش کنید و سپس پاسخ درست را انتخاب کنید.',
        'HIW' => 'گوش کنید و کلماتی از متن را که با صدا تفاوت دارند مشخص کنید.',
        'FIB_L' => 'گوش کنید و سپس کلمات جاافتاده را تایپ کنید.',
        'SMW' => 'گوش کنید و عبارتی را که فایل صوتی را کامل می‌کند انتخاب کنید.',
        'RO' => 'پاراگراف‌ها را به ترتیب درست بچینید.',
        'FIB_R' => 'برای هر جای خالی کلمه مناسب را انتخاب کنید.',
        'FIB_RW' => 'برای هر جای خالی یک کلمه بکشید و رها کنید.',
        'MCQ_R' => 'متن را بخوانید و سپس پاسخ درست را انتخاب کنید.',
        'SWT' => 'متن را در یک جمله بین :min تا :max کلمه خلاصه کنید.',
        'ESSAY' => 'در :minutes دقیقه مقاله‌ای بین :min تا :max کلمه بنویسید.',
    ],

];
